{
  "products": "Productos",
  "name": "Nombre",
  "price": "Precio",
  "stock": "Stock",
  "actions": "Acciones",
  "add new product": "Agregar nuevo producto",
  "need stock": "Necesita stock",
  "please wait while we create your product": "Por favor espera mientras creamos tu producto",
  "*disable if there is no specific stock assigned to this product": "*Deshabilitar si no hay un stock especifico asignado a este producto",
  "productPricePositive": "El precio del producto debe ser un número positivo",
  "productStockPositive": "El stock del producto debe ser un número positivo",
  "fieldIsRequired": "{{field}} es un campo obligatorio",
  "createProduct": "Crear Producto",
  "Product name is required": "El nombre del producto es obligatorio",
  "Product name must be longer than 3 characters": "El nombre del producto debe tener más de 3 caracteres",
  "Product price is required": "El precio del producto es obligatorio",
  "Product price must be a number": "El precio del producto debe ser un número",
  "Product price must be greater than 0": "El precio del producto debe ser mayor que 0",
  "Product need stock is required": "Se requiere el stock del producto",
  "Product need stock should be boolean": "El campo de necesidad de stock debe ser booleano",
  "Product stock is required": "El stock del producto es necesario",
  "Product stock not required": "No se requiere stock del producto",
  "At least one value is required": "Se requiere al menos un valor",
  "The provided value is too long for the column's type.": "El valor proporcionado es demasiado largo para el tipo de columna.",
  "The requested record does not exist.": "El registro solicitado no existe.",
  "Failed due to a unique constraint violation.": "Error debido a una violación de la restricción única.",
  "Failed due to a foreign key constraint violation.": "Error debido a una violación de la restricción de clave externa.",
  "A database constraint has failed.": "Ha fallado una restricción de la base de datos.",
  "The stored value for the field is invalid.": "El valor almacenado para el campo es inválido.",
  "The provided value for the field is not valid.": "El valor proporcionado para el campo no es válido.",
  "Data validation error.": "Error de validación de datos.",
  "Failed to parse the query.": "Fallo al analizar la consulta.",
  "Failed to validate the query.": "Fallo al validar la consulta.",
  "Raw query execution failed.": "Fallo en la ejecución de una consulta en bruto.",
  "Null constraint violation.": "Violación de la restricción de nulidad.",
  "A required value is missing.": "Falta un valor requerido.",
  "A required argument is missing.": "Falta un argumento requerido.",
  "The requested change violates a required relation.": "El cambio solicitado viola una relación requerida.",
  "A related record could not be found.": "No se pudo encontrar un registro relacionado.",
  "Query interpretation error.": "Error de interpretación de la consulta.",
  "Records for a relation are not connected.": "Los registros de una relación no están conectados.",
  "Required connected records were not found.": "No se encontraron los registros conectados requeridos.",
  "Input error.": "Error de entrada.",
  "Value out of range for the type.": "Valor fuera de rango para el tipo.",
  "The specified table does not exist.": "La tabla especificada no existe.",
  "The specified column does not exist.": "La columna especificada no existe.",
  "Inconsistent column data.": "Datos inconsistentes en la columna.",
  "Timed out fetching a new connection from the connection pool.": "Se agotó el tiempo de recuperación de una nueva conexión desde el grupo de conexiones.",
  "An operation failed due to missing required records.": "Error de operación debido a registros requeridos faltantes.",
  "The current database provider does not support a feature used in the query.": "El proveedor de bases de datos actual no admite una característica utilizada en la consulta.",
  "Multiple errors occurred during query execution.": "Se produjeron varios errores durante la ejecución de la consulta.",
  "Transaction API error.": "Error en la API de transacciones.",
  "Cannot find a fulltext index to use for the search.": "No se puede encontrar un índice de texto completo para usar en la búsqueda.",
  "Prisma requires MongoDB server to be run as a replica set for transactions.": "Prisma requiere que el servidor MongoDB se ejecute como un conjunto de réplicas para las transacciones.",
  "A number used in the query exceeds supported limits.": "Un número utilizado en la consulta excede los límites admitidos.",
  "Transaction failed due to a write conflict or a deadlock. Please retry.": "La transacción falló debido a un conflicto de escritura o un bloqueo. Por favor, reintente.",
  "No data available to be shown": "No Hay datos disponibles para mostrar"
}
